---
kind: method
id: M:Autodesk.Revit.UI.RevitCommandId.Dispose
source: html/d1a38bfb-0354-375e-62e6-c2af49256ecd.htm
---
# Autodesk.Revit.UI.RevitCommandId.Dispose Method

Releases all resources used by the RevitCommandId

## Syntax (C#)
```csharp
public void Dispose()
```